Blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "autor", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Welcome"], ["autor", "Reda"], ["text", "This is a test"], ["created_at", "2015-02-06 20:32:08.945339"], ["updated_at", "2015-02-06 20:32:08.945339"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save