blog1/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "royce d"], ["text", "a"], ["created_at", "2015-02-06 17:37:21.028184"], ["updated_at", "2015-02-06 17:37:21.028184"]]